using Microsoft.EntityFrameworkCore.Migrations;
using Npgsql.EntityFrameworkCore.PostgreSQL.Metadata;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace SalesAnalisys.Migrations
{
    /// <inheritdoc />
    public partial class Initial : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "Product",
                columns: table => new
                {
                    Id = table.Column<int>(type: "integer", nullable: false)
                        .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                    Name = table.Column<string>(type: "character varying(255)", maxLength: 255, nullable: false),
                    Price = table.Column<double>(type: "double precision", nullable: false),
                    Total = table.Column<double>(type: "double precision", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Product", x => x.Id);
                });

            migrationBuilder.InsertData(
                table: "Product",
                columns: new[] { "Id", "Name", "Price", "Total" },
                values: new object[,]
                {
                    { 99801, "Мягкая игрушка", 36000.0, 51.0 },
                    { 99802, "Косметичка", 30000.0, 41.0 },
                    { 99803, "Скатерть", 51000.0, 64.0 },
                    { 99804, "Рюкзак", 24000.0, 27.0 },
                    { 99805, "Подставка для телефона", 64000.0, 70.0 },
                    { 99806, "Зажигалка", 36000.0, 55.0 },
                    { 99807, "Радио", 16000.0, 30.0 },
                    { 99808, "Гель для душа", 34000.0, 44.0 },
                    { 99809, "Ножницы", 31000.0, 55.0 },
                    { 99810, "Кольцо", 62000.0, 71.0 },
                    { 99811, "Серьги", 63000.0, 67.0 },
                    { 99812, "Ботинки", 23000.0, 30.0 },
                    { 99813, "Колонка", 53000.0, 76.0 },
                    { 99814, "Свитер", 23000.0, 27.0 },
                    { 99815, "Вешалка", 31000.0, 49.0 },
                    { 99816, "Лампа", 33000.0, 55.0 },
                    { 99817, "Шоколадка", 24000.0, 27.0 },
                    { 99818, "Молоток", 49000.0, 63.0 },
                    { 99819, "Краска для волос", 52000.0, 68.0 },
                    { 99820, "Печка", 44000.0, 60.0 },
                    { 99821, "Пенал", 47000.0, 57.0 },
                    { 99822, "Письменный стол", 18000.0, 33.0 },
                    { 99823, "Кастрюля", 24000.0, 27.0 },
                    { 99824, "Футбольный мяч", 50000.0, 60.0 },
                    { 99825, "Пальто", 32000.0, 49.0 },
                    { 99826, "Фонарик", 53000.0, 75.0 },
                    { 99827, "Костюм", 16000.0, 30.0 },
                    { 99828, "Компьютерная мышь", 57000.0, 71.0 },
                    { 99829, "Вино", 27000.0, 40.0 },
                    { 99830, "Столешница", 24000.0, 39.0 },
                    { 99831, "Печь", 22000.0, 40.0 },
                    { 99832, "Кольцо", 17000.0, 31.0 },
                    { 99833, "Журнал", 23000.0, 28.0 },
                    { 99834, "Спортивные штаны", 50000.0, 63.0 },
                    { 99835, "Детская книга", 42000.0, 65.0 },
                    { 99836, "Зубная щетка", 45000.0, 50.0 },
                    { 99837, "Мыло", 23000.0, 30.0 },
                    { 99838, "Бейсболка", 15000.0, 33.0 },
                    { 99839, "Телефон", 42000.0, 49.0 },
                    { 99840, "Паззл", 24000.0, 37.0 },
                    { 99841, "Зонт", 23000.0, 30.0 },
                    { 99842, "Гитара", 24000.0, 31.0 },
                    { 99843, "Фляга", 49000.0, 63.0 },
                    { 99844, "Туфли", 20000.0, 44.0 },
                    { 99845, "Майка", 53000.0, 58.0 },
                    { 99846, "Халат", 27000.0, 40.0 },
                    { 99847, "Скатерть", 32000.0, 38.0 },
                    { 99848, "Сумка для ноутбука", 20000.0, 32.0 },
                    { 99849, "Часы", 42000.0, 49.0 },
                    { 99850, "Шоколад", 35000.0, 54.0 },
                    { 99851, "Косилка", 39000.0, 49.0 },
                    { 99852, "Пыльца", 55000.0, 64.0 },
                    { 99853, "Рамка для фото", 41000.0, 49.0 },
                    { 99854, "Термос", 20000.0, 44.0 },
                    { 99855, "Пылесос", 34000.0, 43.0 },
                    { 99856, "Ветровка", 57000.0, 70.0 },
                    { 99857, "Спальный мешок", 23000.0, 42.0 },
                    { 99858, "Пианино", 21000.0, 33.0 },
                    { 99859, "Сапоги", 31000.0, 48.0 },
                    { 99860, "Косметичка", 50000.0, 60.0 },
                    { 99861, "Зеркало", 42000.0, 65.0 },
                    { 99862, "Подставка для ноутбука", 41000.0, 53.0 },
                    { 99863, "Мяч", 23000.0, 34.0 },
                    { 99864, "Подушка", 34000.0, 43.0 },
                    { 99865, "Очки", 18000.0, 29.0 },
                    { 99866, "Сумка", 45000.0, 62.0 },
                    { 99867, "Браслет", 31000.0, 55.0 },
                    { 99868, "Кружка", 30000.0, 42.0 },
                    { 99869, "Сковорода", 45000.0, 49.0 },
                    { 99870, "Коврик для йоги", 50000.0, 70.0 },
                    { 99871, "Печка", 38000.0, 49.0 },
                    { 99872, "Зонтик", 57000.0, 76.0 },
                    { 99873, "Подушка", 35000.0, 38.0 },
                    { 99874, "Шапка", 30000.0, 48.0 },
                    { 99875, "Велосипед", 50000.0, 61.0 },
                    { 99876, "Пазл", 54000.0, 59.0 },
                    { 99877, "Пижама", 25000.0, 42.0 },
                    { 99878, "Платье", 33000.0, 42.0 },
                    { 99879, "Клавиатура", 17000.0, 31.0 },
                    { 99880, "Мышь", 54000.0, 63.0 },
                    { 99881, "Скейтборд", 16000.0, 33.0 },
                    { 99882, "Светильник", 32000.0, 49.0 },
                    { 99883, "Ковер", 46000.0, 58.0 },
                    { 99884, "Книжная полка", 21000.0, 32.0 },
                    { 99885, "Рюкзак", 54000.0, 67.0 },
                    { 99886, "Джинсы", 16000.0, 28.0 },
                    { 99887, "Футболка", 32000.0, 40.0 },
                    { 99888, "Кресло", 20000.0, 37.0 },
                    { 99889, "Стол", 61000.0, 67.0 },
                    { 99890, "Чайник", 45000.0, 62.0 },
                    { 99891, "Кроссовки", 34000.0, 48.0 },
                    { 99892, "Шарф", 60000.0, 68.0 },
                    { 99893, "Наушники", 21000.0, 37.0 },
                    { 99894, "Планшет", 43000.0, 54.0 },
                    { 99895, "Кофеварка", 19000.0, 34.0 },
                    { 99896, "Фитнес-трекер", 61000.0, 70.0 },
                    { 99897, "Смартфон", 54000.0, 58.0 },
                    { 99898, "Ноутбук", 45000.0, 57.0 },
                    { 99899, "Фотоаппарат", 37000.0, 54.0 },
                    { 99900, "Книга", 34000.0, 48.0 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "Product");
        }
    }
}
