using Microsoft.EntityFrameworkCore.Migrations;
using Npgsql.EntityFrameworkCore.PostgreSQL.Metadata;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace SalesAnalisys.Migrations
{
    /// <inheritdoc />
    public partial class InitialCreate : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "Product",
                columns: table => new
                {
                    Id = table.Column<int>(type: "integer", nullable: false)
                        .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                    Name = table.Column<string>(type: "character varying(255)", maxLength: 255, nullable: false),
                    Price = table.Column<double>(type: "double precision", nullable: false),
                    Total = table.Column<double>(type: "double precision", nullable: false),
                    Cluster = table.Column<int>(type: "integer", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Product", x => x.Id);
                });

            migrationBuilder.InsertData(
                table: "Product",
                columns: new[] { "Id", "Cluster", "Name", "Price", "Total" },
                values: new object[,]
                {
                    { 1, 3, "Мягкая игрушка", 35000.0, 16.0 },
                    { 2, 3, "Косметичка", 22000.0, 21.0 },
                    { 3, 2, "Скатерть", 24000.0, 38.0 },
                    { 4, 1, "Рюкзак", 63000.0, 20.0 },
                    { 5, 0, "Подставка для телефона", 40000.0, 46.0 },
                    { 6, 0, "Зажигалка", 32000.0, 35.0 },
                    { 7, 0, "Радио", 42000.0, 33.0 },
                    { 8, 3, "Гель для душа", 17000.0, 3.0 },
                    { 9, 2, "Ножницы", 21000.0, 27.0 },
                    { 10, 2, "Кольцо", 34000.0, 47.0 },
                    { 11, 1, "Серьги", 44000.0, 20.0 },
                    { 12, 2, "Ботинки", 30000.0, 45.0 },
                    { 13, 1, "Колонка", 60000.0, 10.0 },
                    { 14, 2, "Свитер", 15000.0, 22.0 },
                    { 15, 2, "Вешалка", 23000.0, 25.0 },
                    { 16, 2, "Лампа", 17000.0, 32.0 },
                    { 17, 3, "Шоколадка", 40000.0, 18.0 },
                    { 18, 3, "Молоток", 28000.0, 15.0 },
                    { 19, 1, "Краска для волос", 54000.0, 18.0 },
                    { 20, 2, "Печка", 23000.0, 26.0 },
                    { 21, 0, "Пенал", 40000.0, 59.0 },
                    { 22, 3, "Письменный стол", 31000.0, 34.0 },
                    { 23, 3, "Кастрюля", 18000.0, 14.0 },
                    { 24, 0, "Футбольный мяч", 38000.0, 47.0 },
                    { 25, 1, "Пальто", 57000.0, 23.0 },
                    { 26, 3, "Фонарик", 34000.0, 15.0 },
                    { 27, 1, "Костюм", 46000.0, 5.0 },
                    { 28, 3, "Компьютерная мышь", 23000.0, 8.0 },
                    { 29, 2, "Вино", 16000.0, 19.0 },
                    { 30, 3, "Столешница", 23000.0, 16.0 },
                    { 31, 1, "Печь", 46000.0, 13.0 },
                    { 32, 1, "Кольцо", 53000.0, 12.0 },
                    { 33, 1, "Журнал", 62000.0, 35.0 },
                    { 34, 1, "Спортивные штаны", 55000.0, 1.0 },
                    { 35, 2, "Детская книга", 35000.0, 47.0 },
                    { 36, 2, "Зубная щетка", 15000.0, 29.0 },
                    { 37, 0, "Мыло", 43000.0, 45.0 },
                    { 38, 1, "Бейсболка", 42000.0, 15.0 },
                    { 39, 3, "Телефон", 33000.0, 10.0 },
                    { 40, 3, "Паззл", 29000.0, 22.0 },
                    { 41, 3, "Зонт", 17000.0, 6.0 },
                    { 42, 2, "Гитара", 26000.0, 29.0 },
                    { 43, 3, "Фляга", 31000.0, 21.0 },
                    { 44, 3, "Туфли", 20000.0, 12.0 },
                    { 45, 3, "Майка", 18000.0, 10.0 },
                    { 46, 1, "Халат", 55000.0, 44.0 },
                    { 47, 0, "Скатерть", 42000.0, 26.0 },
                    { 48, 0, "Сумка для ноутбука", 51000.0, 49.0 },
                    { 49, 3, "Часы", 33000.0, 31.0 },
                    { 50, 1, "Шоколад", 44000.0, 12.0 },
                    { 51, 1, "Косилка", 44000.0, 7.0 },
                    { 52, 1, "Пыльца", 42000.0, 5.0 },
                    { 53, 2, "Рамка для фото", 21000.0, 21.0 },
                    { 54, 2, "Термос", 20000.0, 29.0 },
                    { 55, 1, "Пылесос", 49000.0, 2.0 },
                    { 56, 1, "Ветровка", 56000.0, 39.0 },
                    { 57, 2, "Спальный мешок", 25000.0, 48.0 },
                    { 58, 2, "Пианино", 22000.0, 28.0 },
                    { 59, 1, "Сапоги", 54000.0, 16.0 },
                    { 60, 0, "Косметичка", 40000.0, 43.0 },
                    { 61, 2, "Зеркало", 16000.0, 31.0 },
                    { 62, 1, "Подставка для ноутбука", 62000.0, 32.0 },
                    { 63, 2, "Мяч", 20000.0, 21.0 },
                    { 64, 1, "Подушка", 45000.0, 12.0 },
                    { 65, 0, "Очки", 43000.0, 27.0 },
                    { 66, 2, "Сумка", 15000.0, 31.0 },
                    { 67, 2, "Браслет", 30000.0, 49.0 },
                    { 68, 3, "Кружка", 24000.0, 5.0 },
                    { 69, 0, "Сковорода", 51000.0, 40.0 },
                    { 70, 2, "Коврик для йоги", 35000.0, 52.0 },
                    { 71, 1, "Печка", 55000.0, 24.0 },
                    { 72, 3, "Зонтик", 35000.0, 27.0 },
                    { 73, 3, "Подушка", 28000.0, 28.0 },
                    { 74, 3, "Шапка", 20000.0, 17.0 },
                    { 75, 2, "Велосипед", 15000.0, 23.0 },
                    { 76, 1, "Пазл", 59000.0, 38.0 },
                    { 77, 3, "Пижама", 23000.0, 1.0 },
                    { 78, 2, "Платье", 28000.0, 52.0 },
                    { 79, 3, "Клавиатура", 28000.0, 9.0 },
                    { 80, 1, "Мышь", 55000.0, 2.0 },
                    { 81, 1, "Скейтборд", 55000.0, 7.0 },
                    { 82, 0, "Светильник", 45000.0, 29.0 },
                    { 83, 3, "Ковер", 22000.0, 10.0 },
                    { 84, 0, "Книжная полка", 40000.0, 49.0 },
                    { 85, 0, "Рюкзак", 41000.0, 37.0 },
                    { 86, 3, "Джинсы", 16000.0, 1.0 },
                    { 87, 1, "Футболка", 52000.0, 12.0 },
                    { 88, 2, "Кресло", 23000.0, 28.0 },
                    { 89, 1, "Стол", 54000.0, 18.0 },
                    { 90, 0, "Чайник", 49000.0, 58.0 },
                    { 91, 2, "Кроссовки", 21000.0, 31.0 },
                    { 92, 3, "Шарф", 24000.0, 22.0 },
                    { 93, 1, "Наушники", 65000.0, 13.0 },
                    { 94, 1, "Планшет", 64000.0, 48.0 },
                    { 95, 1, "Кофеварка", 40000.0, 1.0 },
                    { 96, 3, "Фитнес-трекер", 22000.0, 13.0 },
                    { 97, 2, "Смартфон", 19000.0, 18.0 },
                    { 98, 1, "Ноутбук", 50000.0, 19.0 },
                    { 99, 3, "Фотоаппарат", 31000.0, 33.0 },
                    { 100, 1, "Книга", 48000.0, 22.0 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "Product");
        }
    }
}
