using Microsoft.EntityFrameworkCore.Migrations;
using Npgsql.EntityFrameworkCore.PostgreSQL.Metadata;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace SalesAnalisys.Migrations
{
    /// <inheritdoc />
    public partial class add : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "Product",
                columns: table => new
                {
                    Id = table.Column<int>(type: "integer", nullable: false)
                        .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                    Name = table.Column<string>(type: "character varying(255)", maxLength: 255, nullable: false),
                    Price = table.Column<double>(type: "double precision", nullable: false),
                    Total = table.Column<double>(type: "double precision", nullable: false),
                    Cluster = table.Column<int>(type: "integer", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Product", x => x.Id);
                });

            migrationBuilder.InsertData(
                table: "Product",
                columns: new[] { "Id", "Cluster", "Name", "Price", "Total" },
                values: new object[,]
                {
                    { 99801, 0, "Мягкая игрушка", 35000.0, 16.0 },
                    { 99802, 0, "Косметичка", 22000.0, 21.0 },
                    { 99803, 0, "Скатерть", 24000.0, 38.0 },
                    { 99804, 0, "Рюкзак", 63000.0, 20.0 },
                    { 99805, 0, "Подставка для телефона", 40000.0, 46.0 },
                    { 99806, 0, "Зажигалка", 32000.0, 35.0 },
                    { 99807, 0, "Радио", 42000.0, 33.0 },
                    { 99808, 0, "Гель для душа", 17000.0, 3.0 },
                    { 99809, 0, "Ножницы", 21000.0, 27.0 },
                    { 99810, 0, "Кольцо", 34000.0, 47.0 },
                    { 99811, 0, "Серьги", 44000.0, 20.0 },
                    { 99812, 0, "Ботинки", 30000.0, 45.0 },
                    { 99813, 0, "Колонка", 60000.0, 10.0 },
                    { 99814, 0, "Свитер", 15000.0, 22.0 },
                    { 99815, 0, "Вешалка", 23000.0, 25.0 },
                    { 99816, 0, "Лампа", 17000.0, 32.0 },
                    { 99817, 0, "Шоколадка", 40000.0, 18.0 },
                    { 99818, 0, "Молоток", 28000.0, 15.0 },
                    { 99819, 0, "Краска для волос", 54000.0, 18.0 },
                    { 99820, 0, "Печка", 23000.0, 26.0 },
                    { 99821, 0, "Пенал", 40000.0, 59.0 },
                    { 99822, 0, "Письменный стол", 31000.0, 34.0 },
                    { 99823, 0, "Кастрюля", 18000.0, 14.0 },
                    { 99824, 0, "Футбольный мяч", 38000.0, 47.0 },
                    { 99825, 0, "Пальто", 57000.0, 23.0 },
                    { 99826, 0, "Фонарик", 34000.0, 15.0 },
                    { 99827, 0, "Костюм", 46000.0, 5.0 },
                    { 99828, 0, "Компьютерная мышь", 23000.0, 8.0 },
                    { 99829, 0, "Вино", 16000.0, 19.0 },
                    { 99830, 0, "Столешница", 23000.0, 16.0 },
                    { 99831, 0, "Печь", 46000.0, 13.0 },
                    { 99832, 0, "Кольцо", 53000.0, 12.0 },
                    { 99833, 0, "Журнал", 62000.0, 35.0 },
                    { 99834, 0, "Спортивные штаны", 55000.0, 1.0 },
                    { 99835, 0, "Детская книга", 35000.0, 47.0 },
                    { 99836, 0, "Зубная щетка", 15000.0, 29.0 },
                    { 99837, 0, "Мыло", 43000.0, 45.0 },
                    { 99838, 0, "Бейсболка", 42000.0, 15.0 },
                    { 99839, 0, "Телефон", 33000.0, 10.0 },
                    { 99840, 0, "Паззл", 29000.0, 22.0 },
                    { 99841, 0, "Зонт", 17000.0, 6.0 },
                    { 99842, 0, "Гитара", 26000.0, 29.0 },
                    { 99843, 0, "Фляга", 31000.0, 21.0 },
                    { 99844, 0, "Туфли", 20000.0, 12.0 },
                    { 99845, 0, "Майка", 18000.0, 10.0 },
                    { 99846, 0, "Халат", 55000.0, 44.0 },
                    { 99847, 0, "Скатерть", 42000.0, 26.0 },
                    { 99848, 0, "Сумка для ноутбука", 51000.0, 49.0 },
                    { 99849, 0, "Часы", 33000.0, 31.0 },
                    { 99850, 0, "Шоколад", 44000.0, 12.0 },
                    { 99851, 0, "Косилка", 44000.0, 7.0 },
                    { 99852, 0, "Пыльца", 42000.0, 5.0 },
                    { 99853, 0, "Рамка для фото", 21000.0, 21.0 },
                    { 99854, 0, "Термос", 20000.0, 29.0 },
                    { 99855, 0, "Пылесос", 49000.0, 2.0 },
                    { 99856, 0, "Ветровка", 56000.0, 39.0 },
                    { 99857, 0, "Спальный мешок", 25000.0, 48.0 },
                    { 99858, 0, "Пианино", 22000.0, 28.0 },
                    { 99859, 0, "Сапоги", 54000.0, 16.0 },
                    { 99860, 0, "Косметичка", 40000.0, 43.0 },
                    { 99861, 0, "Зеркало", 16000.0, 31.0 },
                    { 99862, 0, "Подставка для ноутбука", 62000.0, 32.0 },
                    { 99863, 0, "Мяч", 20000.0, 21.0 },
                    { 99864, 0, "Подушка", 45000.0, 12.0 },
                    { 99865, 0, "Очки", 43000.0, 27.0 },
                    { 99866, 0, "Сумка", 15000.0, 31.0 },
                    { 99867, 0, "Браслет", 30000.0, 49.0 },
                    { 99868, 0, "Кружка", 24000.0, 5.0 },
                    { 99869, 0, "Сковорода", 51000.0, 40.0 },
                    { 99870, 0, "Коврик для йоги", 35000.0, 52.0 },
                    { 99871, 0, "Печка", 55000.0, 24.0 },
                    { 99872, 0, "Зонтик", 35000.0, 27.0 },
                    { 99873, 0, "Подушка", 28000.0, 28.0 },
                    { 99874, 0, "Шапка", 20000.0, 17.0 },
                    { 99875, 0, "Велосипед", 15000.0, 23.0 },
                    { 99876, 0, "Пазл", 59000.0, 38.0 },
                    { 99877, 0, "Пижама", 23000.0, 1.0 },
                    { 99878, 0, "Платье", 28000.0, 52.0 },
                    { 99879, 0, "Клавиатура", 28000.0, 9.0 },
                    { 99880, 0, "Мышь", 55000.0, 2.0 },
                    { 99881, 0, "Скейтборд", 55000.0, 7.0 },
                    { 99882, 0, "Светильник", 45000.0, 29.0 },
                    { 99883, 0, "Ковер", 22000.0, 10.0 },
                    { 99884, 0, "Книжная полка", 40000.0, 49.0 },
                    { 99885, 0, "Рюкзак", 41000.0, 37.0 },
                    { 99886, 0, "Джинсы", 16000.0, 1.0 },
                    { 99887, 0, "Футболка", 52000.0, 12.0 },
                    { 99888, 0, "Кресло", 23000.0, 28.0 },
                    { 99889, 0, "Стол", 54000.0, 18.0 },
                    { 99890, 0, "Чайник", 49000.0, 58.0 },
                    { 99891, 0, "Кроссовки", 21000.0, 31.0 },
                    { 99892, 0, "Шарф", 24000.0, 22.0 },
                    { 99893, 0, "Наушники", 65000.0, 13.0 },
                    { 99894, 0, "Планшет", 64000.0, 48.0 },
                    { 99895, 0, "Кофеварка", 40000.0, 1.0 },
                    { 99896, 0, "Фитнес-трекер", 22000.0, 13.0 },
                    { 99897, 0, "Смартфон", 19000.0, 18.0 },
                    { 99898, 0, "Ноутбук", 50000.0, 19.0 },
                    { 99899, 0, "Фотоаппарат", 31000.0, 33.0 },
                    { 99900, 0, "Книга", 48000.0, 22.0 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "Product");
        }
    }
}
